We are calling pandas as pd and this allows calling the functions in pandas as pd.function_name() instead of pandas.function_name(). This is a standard convention in Python programming and you will see it in many places. It is also common to see import pandas as pd, which is the same thing but allows you to use pd instead of pandas.

In [2]:
import pandas as pd

Pandas Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively called index. Pandas Series is nothing but a column in an excel sheet.

In [31]:
obj=pd.Series(['apple', 2, ['a','b','c'], 3.5, {'key':'value'}])

In [26]:
obj

0               apple
1                   2
2           [a, b, c]
3                 3.5
4    {'key': 'value'}
dtype: object

In [32]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
obj.values

array(['apple', 2, list(['a', 'b', 'c']), 3.5, {'key': 'value'}],
      dtype=object)

If you want to create a Series with your own index, you can do so by passing in a list of values along with the index.

In [33]:
obj.index=['a','b','c','d','e']

In [34]:
obj

a               apple
b                   2
c           [a, b, c]
d                 3.5
e    {'key': 'value'}
dtype: object

If you want the value with specific index, you can do so by calling the index.

In [35]:
obj['a']

'apple'

In [36]:
obj['e']

{'key': 'value'}

In [37]:
obj['e']['key']

'value'

Pandas DataFrame is a spreadsheet-like data structure. You can think of it as a table with rows and columns. Each column is a Pandas Series. You can create a DataFrame by passing in a dictionary of Pandas Series. The keys of the dictionary will be the column names and the values will be the values in the column.

In [80]:
df = pd.DataFrame({'a':[1,2,3,'a','b','c', 'a','B','C'], 
                   'b':[4,5,6,'d','e','f', 'D','E','F'], 
                   'c':[7,8,9,'a','b','c', 'G','H','I'], 
                   'd':[10,11,12,13,14,15,16,17,18], 
                   'e':[13,14,15,'m','n','o', 'M','N','O'], 
                   'f':[16,17,18,'p','q','r', 'P','Q','R']})

In [73]:
df

   a  b  c   d   e   f
0  1  4  7  10  13  16
1  2  5  8  11  14  17
2  3  6  9  12  15  18
3  a  d  a   j   m   p
4  b  e  b   k   n   q
5  c  f  c   l   o   r
6  A  D  G   J   M   P
7  B  E  H   K   N   Q
8  C  F  I   L   O   R

You can call the column by calling the column name.

In [134]:
df.columns

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

You can return the first few rows of the DataFrame by calling the head() function. You can also return the last few rows of the DataFrame by calling the tail() function.

In [51]:
df.head()

   a  b  c   d   e   f
0  1  4  7  10  13  16
1  2  5  8  11  14  17
2  3  6  9  12  15  18
3  a  d  g   j   m   p
4  b  e  h   k   n   q

In [52]:
df.tail()

   a  b  c  d  e  f
4  b  e  h  k  n  q
5  c  f  i  l  o  r
6  A  D  G  J  M  P
7  B  E  H  K  N  Q
8  C  F  I  L  O  R

We can also specify the number of rows we want to return by passing in the number as an argument to the head() and tail() functions.

In [53]:
df.head(2)

   a  b  c   d   e   f
0  1  4  7  10  13  16
1  2  5  8  11  14  17

In [54]:
df.tail(2)

   a  b  c  d  e  f
7  B  E  H  K  N  Q
8  C  F  I  L  O  R

When we want to get rid of the column, we can do so by calling the drop() function. We need to specify the axis=1 to indicate that we are dropping a column. If we want to drop a row, we can do so by calling the drop() function and specify the axis=0.

In [57]:
df.drop(['a', 'b'], axis=1)

   c   d   e   f
0  7  10  13  16
1  8  11  14  17
2  9  12  15  18
3  g   j   m   p
4  h   k   n   q
5  i   l   o   r
6  G   J   M   P
7  H   K   N   Q
8  I   L   O   R

In [66]:
df.drop([7, 8], axis=0)

   a  b  c   d   e   f
0  1  4  7  10  13  16
1  2  5  8  11  14  17
2  3  6  9  12  15  18
3  a  d  g   j   m   p
4  b  e  h   k   n   q
5  c  f  i   l   o   r
6  A  D  G   J   M   P

When you want to subset the DataFrame with specific values from specific column, you can place the condition in the square brackets.

In [79]:
df[df['a']=='a']

   a  b  c  d  e  f
3  a  d  a  j  m  p
6  a  D  G  J  M  P

You can also subset the DataFrame larger than or smaller than a specific value.

In [81]:
df[df['d']>12]

   a  b  c   d  e  f
3  a  d  a  13  m  p
4  b  e  b  14  n  q
5  c  f  c  15  o  r
6  a  D  G  16  M  P
7  B  E  H  17  N  Q
8  C  F  I  18  O  R

You can also subset the DataFrame with multiple conditions. You need to use the & symbol to indicate the AND condition and the | symbol to indicate the OR condition.

In [84]:
df[(df['a']=='a') | (df['d']>12)]

   a  b  c   d  e  f
3  a  d  a  13  m  p
4  b  e  b  14  n  q
5  c  f  c  15  o  r
6  a  D  G  16  M  P
7  B  E  H  17  N  Q
8  C  F  I  18  O  R

In [85]:
df[(df['a']=='a') & (df['d']>12)]

   a  b  c   d  e  f
3  a  d  a  13  m  p
6  a  D  G  16  M  P

You can also subset the DataFrame with index values. You need to use the loc[] function to specify the index values and the column names.

In [92]:
df.loc[0:2, ['a', 'b']]

   a  b
0  1  4
1  2  5
2  3  6

.iloc[] is another function that allows you to subset the DataFrame with index values. The difference between .loc[] and .iloc[] is that .loc[] allows you to subset the DataFrame with index values and column names, while .iloc[] allows you to subset the DataFrame with index values and column numbers.

In [93]:
df.iloc[0:2, 0:2]

   a  b
0  1  4
1  2  5

Statistics can be calculated on the DataFrame. You can calculate the mean, median, mode, standard deviation, variance, minimum, maximum, and count of the DataFrame.

In [96]:
df['d'].min()

10

In [97]:
df['d'].max()

18

In [98]:
df['d'].mean()

14.0

In [99]:
df['d'].std()

2.7386127875258306

In [100]:
df['d'].var()

7.5

In [101]:
df['d'].unique()

array([10, 11, 12, 13, 14, 15, 16, 17, 18])

When you run into the real data, you will likely to find missing values. You can use the isnull() function to find the missing values. You can also use the notnull() function to find the non-missing values.

In [6]:
from numpy import nan

In [7]:
df_nan=pd.DataFrame({'a':[1,2,3,nan,5,6, nan, 8, 9],
                    'b':[4,5,6,nan,8,9, nan, 11, 12],
                    'c':[7,8,9,10,nan, 12, nan, 14, 15],
                    'd':[10,11,12,nan,14,15, nan, 17, 18],
                    'e':[13,14,15,nan,17,18, nan, 20, 21],
                    'f':[nan,16, 17,18,19,20, nan, nan, 24]})

In [8]:
df_nan

     a     b     c     d     e     f
0  1.0   4.0   7.0  10.0  13.0   NaN
1  2.0   5.0   8.0  11.0  14.0  16.0
2  3.0   6.0   9.0  12.0  15.0  17.0
3  NaN   NaN  10.0   NaN   NaN  18.0
4  5.0   8.0   NaN  14.0  17.0  19.0
5  6.0   9.0  12.0  15.0  18.0  20.0
6  NaN   NaN   NaN   NaN   NaN   NaN
7  8.0  11.0  14.0  17.0  20.0   NaN
8  9.0  12.0  15.0  18.0  21.0  24.0

You can drop the missing values by calling the dropna() function. However, this will drop the entire row if there is a missing value in the row.

In [9]:
df_nan.dropna()

     a     b     c     d     e     f
1  2.0   5.0   8.0  11.0  14.0  16.0
2  3.0   6.0   9.0  12.0  15.0  17.0
5  6.0   9.0  12.0  15.0  18.0  20.0
8  9.0  12.0  15.0  18.0  21.0  24.0

You can also fill the missing values with a specific value by calling the fillna() function.

In [10]:
df_nan.fillna(0)

     a     b     c     d     e     f
0  1.0   4.0   7.0  10.0  13.0   0.0
1  2.0   5.0   8.0  11.0  14.0  16.0
2  3.0   6.0   9.0  12.0  15.0  17.0
3  0.0   0.0  10.0   0.0   0.0  18.0
4  5.0   8.0   0.0  14.0  17.0  19.0
5  6.0   9.0  12.0  15.0  18.0  20.0
6  0.0   0.0   0.0   0.0   0.0   0.0
7  8.0  11.0  14.0  17.0  20.0   0.0
8  9.0  12.0  15.0  18.0  21.0  24.0

You can also use dictionary to fill the missing values with different values for different columns.

In [11]:
df_nan.fillna({'a':0, 'b':1, 'c':2, 'd':3, 'e':4, 'f':5})

     a     b     c     d     e     f
0  1.0   4.0   7.0  10.0  13.0   5.0
1  2.0   5.0   8.0  11.0  14.0  16.0
2  3.0   6.0   9.0  12.0  15.0  17.0
3  0.0   1.0  10.0   3.0   4.0  18.0
4  5.0   8.0   2.0  14.0  17.0  19.0
5  6.0   9.0  12.0  15.0  18.0  20.0
6  0.0   1.0   2.0   3.0   4.0   5.0
7  8.0  11.0  14.0  17.0  20.0   5.0
8  9.0  12.0  15.0  18.0  21.0  24.0

You can also change the name of the column by calling the rename() function.

In [12]:
df_nan.rename(columns={'a':'apple', 'b':'banana', 'c':'cat', 'd':'dog', 'e':'elephant', 'f':'fish'})

   apple  banana   cat   dog  elephant  fish
0    1.0     4.0   7.0  10.0      13.0   NaN
1    2.0     5.0   8.0  11.0      14.0  16.0
2    3.0     6.0   9.0  12.0      15.0  17.0
3    NaN     NaN  10.0   NaN       NaN  18.0
4    5.0     8.0   NaN  14.0      17.0  19.0
5    6.0     9.0  12.0  15.0      18.0  20.0
6    NaN     NaN   NaN   NaN       NaN   NaN
7    8.0    11.0  14.0  17.0      20.0   NaN
8    9.0    12.0  15.0  18.0      21.0  24.0

Let's download the data from the Internet. Once we download the data, we can read the data into a DataFrame by calling the read_csv() function.

https://data.world/crowdflower/classification-of-pol-social

In [3]:
data=pd.read_csv('/Volumes/T7/UIUC/Spring_2024/IS324_social_network_analysis/Political-media-DFE.csv', encoding='latin1')

In [14]:
data.shape

(5000, 21)

With this data loaded into a DataFrame, we want to know what metadata (or column) are available in the DataFrame. Let's check the columns.

In [ ]:
#YOUR CODE HERE

We can try printing some rows of the DataFrame to see what data are inside.

In [ ]:
#YOUR CODE HERE

In which column do you think the text data or the tweets are stored?

In [ ]:
#YOUR ANSWER OR CODE HERE

In which column can we find the account name of the person who posted the tweet?

In [ ]:
#YOUN ANSWER OR CODE HERE

Let's use only the tweet text and the account name columns. How do we do that?
We can do this in two ways.
(1) Drop the columns that we don't need.
(2) Subset the columns that we need.

In [ ]:
#YOUR CODE HERE

We don't like the column names. Let's rename the columns.

In [ ]:
#YOUR CODE HERE

We want to subset the data from Ted Yoho, Representative for Florida. How do we do that? How many tweets does this dataset have?

In [ ]:
#YOUR CODE HERE

How many unique account names are there in this dataset? This will help you get a rough idea of the number of unique nodes in the network.

In [ ]:
#YOUR CODE HERE

Do you think there will be more nodes than the number of unique account names when you build the network from this dataset? Why?

In the column where you found the tweet text, do you think what additional information can be extracted from the text? For example, can we extract the hashtags from the text? Can we extract the mentions from the text? Can we extract the URLs from the text?